Revit 2026 API

# ComboBoxCurrentChangedEventArgs Class

---

The event arguments used by ComboBox's CurrentChanged event.

SystemObject SystemEventArgs Autodesk.Revit.UI.EventsRibbonItemEventArgs Autodesk.Revit.UI.EventsComboBoxCurrentChangedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxCurrentChangedEventArgs : RibbonItemEventArgs
```
```vb
Public Class ComboBoxCurrentChangedEventArgs
	Inherits RibbonItemEventArgs
```
```cpp
public ref class ComboBoxCurrentChangedEventArgs : public RibbonItemEventArgs
```
```fsharp
type ComboBoxCurrentChangedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
```

The ComboBoxCurrentChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. (Inherited from RibbonItemEventArgs) |
|  | NewValue | The current item for the ComboBox after the change. |
|  | OldValue | The current item for the ComboBox before the change. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace